app/views/projects/_one_worker_project_form.html.haml

            = fr.label :worker_id
            = fr.select(:worker_id,
            options_for_select(worker_options, fr.object.worker_id),
            {}, class: 'form-control')
---
SELECT ln, id FROM "workers"