app/views/projects/index.html.haml

        %td= project.price
        %td= project.worker_projects.map{ |wp| wp.worker.sn }.join(", ")
---
SELECT "projects".* FROM "projects"