app/views/projects/index.html.haml

        %td= project.price
        %td= project.worker_projects.map{ |wp| wp.worker.sn }.join(", ")
---
SELECT  "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "projects".* FROM "projects"
SELECT "worker_projects".* FROM "worker_projects" WHERE "worker_projects"."project_id" = $1  [["project_id", 1]]