app/views/projects/show.html.haml

SELECT  "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "worker_projects".* FROM "worker_projects" WHERE "worker_projects"."project_id" = $1  [["project_id", 1]]
---
  %b Сотрудники:
  = @project.worker_projects.map{ |wp| wp.worker.sn }.join(', ')