app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "start", "end", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "q"], ["start", "2017-05-24"], ["end", "2017-05-25"], ["price", 1], ["created_at", "2017-05-24 14:04:57.301128"], ["updated_at", "2017-05-24 14:04:57.301128"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save