app/controllers/workers_controller.rb

  def index
    @workers = Worker.all
---
SELECT "workers".* FROM "workers"

  def create
    @worker = Worker.new(worker_params)

    respond_to do |format|
      if @worker.save
---
INSERT INTO "workers" ("sn", "fn", "ln", "passport", "inn", "birthday", "position", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    @worker.destroy
---
DELETE FROM "workers" WHERE "workers"."id" = $1  [["id", 2]]

    def set_worker
      @worker = Worker.find(params[:id])
---
SELECT  "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT 1  [["id", 3]]