app/controllers/worker_projects_controller.rb

  def index
    @worker_projects = WorkerProject.all
---
SELECT "worker_projects".* FROM "worker_projects"