app/controllers/workers_controller.rb

  def index
    @workers = Worker.all
---
SELECT "workers".* FROM "workers"

    def set_worker
      @worker = Worker.find(params[:id])
---
SELECT  "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT 1  [["id", 1]]